app/Controllers/SigninController.php

SELECT *
FROM `users`
WHERE `email` = 'lucas@gmail.com'
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();

        $userModel = new UserModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $userModel->where('email', $email)->first();