app/Models/ReservaModel.php

INSERT INTO `reservas` (`nombre`, `apellidos`, `email`, `telefono`, `direccion`, `fecha_nacimiento`, `nacionalidad`, `dni`, `asientos`) VALUES ('Lucas', 'Fernandez', 'lucas@gmail.com', '3571314337', 'Panama 234', '2005-09-16', 'Argentina', '46509998', '1')
---
    public function procesar($data)
    {
        $this->insert($data);